List<String> ukrainianNames1 = [
  'Андрій', 'Богдан', 'Василь', 'Володимир', 'Григорій',
  'Денис', 'Дмитро', 'Захар', 'Іван', 'Ігор',
  'Кирило', 'Костянтин', 'Леонід', 'Максим', 'Марко',
  'Микола', 'Михайло', 'Назар', 'Олег', 'Олександр',
  'Олексій', 'Павло', 'Петро', 'Роман', 'Руслан',
  'Святослав', 'Сергій', 'Станіслав', 'Степан', 'Тарас',
  'Артем', 'Валентин', 'Євген', 'Юрій', 'Тимур',
  'Ілля', 'Антон', 'Ярослав', 'Віталій', 'Ростислав',
  'Анатолій', 'Зіновій', 'Сава', 'Любомир', 'Вадим',
  'Арсен', 'Всеволод', 'Мирослав', 'Борис', 'Едуард',
];
List<String> ukrainianNames2 = [
  // Чоловічі імена
  'Андрій', 'Богдан', 'Василь', 'Володимир', 'Григорій',
  'Денис', 'Дмитро', 'Захар', 'Іван', 'Ігор',
  'Кирило', 'Костянтин', 'Леонід', 'Максим', 'Марко',
  'Микола', 'Михайло', 'Назар', 'Олег', 'Олександр',
  'Олексій', 'Павло', 'Петро', 'Роман', 'Руслан',
  'Святослав', 'Сергій', 'Станіслав', 'Степан', 'Тарас',

  // Жіночі імена
  'Анастасія', 'Ангеліна', 'Богдана', 'Валерія', 'Вікторія',
  'Ганна', 'Дарина', 'Діана', 'Євгенія', 'Катерина',
  'Ксенія', 'Лариса', 'Людмила', 'Марія', 'Надія',
  'Оксана', 'Олена', 'Софія', 'Тетяна', 'Юлія',
];